play-eventadapter-abstractrdfreceiver/src/test/resources/NonRDFEvent.soap.xml

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To>http://localhost:9000/services/RawService</wsa:To><wsa:ReplyTo><wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address></wsa:ReplyTo><wsa:MessageID>urn:uuid:CA3ACFFB137D03314C1334792570145</wsa:MessageID><wsa:Action>urn:NotifyResponse</wsa:Action></soapenv:Header><soapenv:Body><wsnt:Notify xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"><wsnt:NotificationMessage><wsnt:SubscriptionReference><wsa:Address xmlns:wsa="http://www.w3.org/2005/08/addressing">http://localhost:9000/services/RawService</wsa:Address><wsa:ReferenceParameters xmlns:wsa="http://www.w3.org/2005/08/addressing" /></wsnt:SubscriptionReference><wsnt:Topic xmlns:dsb="http://www.petalslink.org/dsb/topicsns/" Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116">dsb:TaxiUCIMA</wsnt:Topic><wsnt:ProducerReference><wsa:Address xmlns:wsa="http://www.w3.org/2005/08/addressing">jbi://Endpoint</wsa:Address><wsa:ReferenceParameters xmlns:wsa="http://www.w3.org/2005/08/addressing" /></wsnt:ProducerReference><wsnt:Message><ns2:getAvailabilitiesResponse xmlns:ns2="http://IMService.ws.play.orange.com/" /></wsnt:Message></wsnt:NotificationMessage></wsnt:Notify></soapenv:Body></soapenv:Envelope>